{
	"menuEntries": [
		{"anchor": "about", "title": "Introduction"},
      {"anchor": "introskills-container", "title": "Skills"},
		{"anchor": "experience", "title": "Professional Experience"},
		{"anchor": "education", "title": "Education"},
		{"anchor": "projects", "title": "Personal Projects"}
	],
	"intro": {
      "title": "<span class='text-primary'>Scala</span> && Typescript Fullstack Developper",
      "currentPosition": "At <img src='img/cplus.gif' height='16px'/> for <span class='text-primary'>2 years</span> now.",
      "body": [
        "I am working on a GraphQL gateway and on the main REST API behind all our frontend applications in a team of <span class'text-primary'>20 developpers</span><br />",
        "Working with Scalable Reactive systems on a daily basis, with the help of <span class='text-primary'>Play!</span> Framework, <span class='text-primary'>Akka</span>, <span class='text-primary'>Kafka</span>, <span class='text-primary'>Cassandra</span> and <span class='text-primary'>Redis</span>.<br />",
        "Convinced by <span class='text-primary'>Agile</span> developpement cycle and <span class='text-primary'>TDD</span> practices. I'm used to working with AWS, Docker and Immutable State infrastructure (Salt Stack and recently, Kubernetes) <br />",
        "I used to be a Frontend consultant working on many Canal+'s technical backoffices.<br />",
        "I was hired after some month in an Internship while working on an Engineering Degree at EPITA.<br />",
        "I mainly do Scala but I am from a Frontend world I am still working on javascript libraries for CanalPlus frontend developpers and some R&D frontend applications."
      ]
    },
  	"experiences": [
      {
        "position": "FullStack Scala/Typescript Developper",
        "description": "Within a crew of 50 persons inside vack of our video streaming plateform.I am challenged by performance and quality on a daily basic., I am working on various projects written in Scala, Java and Typescript . In an Agile, Scrum and eXtreme Programming environement i can pick up various tasks and occasionally do DevOps tasks, RUN (production operations), peer programming, javascript libraries, CLI tools, creating a software factory with CI and CD.",
        "durationText": "September 2017 - Today",
        "company": "Canal+",
        "companyImg": "<img src='img/cplus.gif' height='16px'/>",
        "showMore": {
          "projects": [
            {
              "title": "HAPI",
              "backdrop": "noBackdrop",
              "description": "HAPI is Canal+'s backend REST API it handles content catalog, user curation, video plays, and data aggregations, rights and portal management for catchup and live TV of Canal+ group. Wth a very high request load and a diversity of web cliens (mobile, pc, TVs, etc ...).",
              "techs": [
                "Scala",
                "Play!",
                "Cassandra",
                "Redis",
                "ElasticSearch",
                "MicroServices",
                "AWS",
                "NGINX"
              ]
            },
            {
              "title": "REAP",
              "backdrop": "noBackdrop",
              "description": "REAP is the centralizer of many Canal+ data sources (Plurimedia, CSA, ImDB, Internal tools, etc..) and is a journalized referential database, Besides HAPI, it is also used for external catalogs (Siri, Google, ISPs, Offline mode, etc ...)",
              "techs": [
                "Scala",
                "Play!",
                "Cassandra",
                "Kafka",
                "JSONP",
                "Redis",
                "ElasticSearch",
                "MicroServices",
                "AWS",
                "NGINX"
              ]
            }
          ]
        }
      },
      {
        "position": "FullStack PHP/Javascript et Typescript Developper",
        "description": "Inside of OMNILOG I was a contract developper during 6 months working on a PHP/Zend Framework internal softeware before being sent to the clients office in Canal+ where I finished some tasks on the internal project before working on HAPI and REAP (Details in Canal+ experience).",
        "company": "Omnilog",
        "durationText": "September 2016 - August 2017",
        "showMore": {
          "projects": [
            {
              "title": "IHM Visio",
              "backdrop": "noBackdrop",
              "description": "Web Interface showing broadcast graphs, market share analysis and daily reports.",
              "techs": [
                "PHP",
                "Symfony2",
                "Javascript",
                "RaphaelJS",
                "HTML5",
                "Bootstrap"
              ]
            },
            {
              "title": "IHM BDDPe : Newsletter V3",
              "backdrop": "noBackdrop",
              "description": "New UI and Backend for newsletter creations based on user likes with human overdrive. Tempating language implementation, creation of a broadcast preselection algorithm, a web interface for manual selection and finally communication with the mailling provider's API",
              "techs": [
                "PHP",
                "Zend Framework",
                "OracleSQL",
                "JavaScript",
                "HTML4",
                "JSON",
                "REST"
              ]
            }
          ]
        }
      },
      {
        "position": "FullStack C#/Javascript Developper",
        "description": "C# (ASP .Net, Windows Forms) developper, I was the only developper in a team of 5. NETCORP web agency with some clients (Bally, Bern Stephane, etc ...). It was my first experience in technical debt handling and bringing new feature ti the CMS alogside some internal tools.",
        "company": "NETCORP Solutions",
        "durationText": "June 2015 - May 2016",
        "showMore": {
          "projects": [
            {
              "title": "IHM Devis",
              "backdrop": "noBackdrop",
              "description": "WinForms interface to create billing documents and automatically suggest products for sellers.",
              "techs": [
                "C#",
                "WindowsForms",
                "SQLServer"
              ]
            },
            {
              "title": "MetroSystem",
              "backdrop": "noBackdrop",
              "description": "MetroSystem was the CMS behind all NETCORP website written in C# WebForms and some JavaScript.",
              "techs": [
                "C#",
                "ASP .Net",
                "SQL Server",
                "JavaScript",
                "HTML4"
              ]
            }
          ]
        }
      }
	],
  "projects": [
    {
      "name": "KomponentsJs",
      "title": "Javascript web components library",
      "description": "This is a light component framework written with JQuery and in commonJs with some ES6 features. This portfolio runs KomponentsJS",
      "link": "https://github.com/DKFN/portfolio-html5"
    },
    {
      "name": "Swirl GraphQL",
      "title": "Tutorial for frontend beginners",
      "description": "The goal of this tutorial is to make a mini Netflix, it was made for both advanced and begineer frontend developpers.",
      "link": "https://github.com/DKFN/Swirl-GraphQL-Subject"
    },
    {
      "name": "FreightTrain",
      "title": "CLI tools for docker linking",
      o"description": "FreightTrain allows easy linking to mock a full architecture on a developpement computer.",
      "link": "https://github.com/DKFN/freighttrain"

    }
  ],
  "skills": [
      {
        "name": "Scala",
        "rating": 4,
        "description": "Since 2 years I have been working profesionnally with Scala and I have trained myself with some personnal projects. Altrough I am fairly advanced I am not yet an expert",
        "category": "Profesionnal"
      },
      {
        "name": "GraphQL",
        "rating": 4,
        "description": "I have been using GraphQL frontend side for 2 years now and since a year I am also working with the Scala GraphQL gateway of our service.",
        "category": "Profesionnal"
      },
      {
        "name": "TypeScript",
        "rating": 5,
        "description": "I work with TypeScript for four years now both profesionnally and personally. I love using ReactJS with it and I have developped many of my frontend works using it.",
        "category": "Profesionnal"
      },
      {
        "name": "JavaScript",
        "rating": 5,
        "description": "I have been using JavaScript since my early days in Web Developement back when I was 13 years old. Using this native skills, I am able to understand conceps in advanced frontend libraries and re-apply them in smaller scale applications (like this portfolio).",
        "category": "Profesionnal"
      },
      {
        "name": "HTML5/CSS3",
        "rating": 5,
        "description": "I have known HTML since HTML4 and CSS2 and I have lived the blessed switch between HTML4/CSS2 to HTML5/CSS3",
        "category": "Profesionnal"
      },
      {
        "name": "ElasticSearch",
        "rating": 4,
        "description": "ElasticSearch is the indexing engine at Canal+. Besides normal usage, I also had to maintain an Elasticsearch plugin written in Java for movie curation.",
        "category": "Profesionnal"
      },
      {
        "name": "Cassandra",
        "rating": 4,
        "description": "Cassandra is the datastore of many Canal+ applications, I have learnt to use it in highly scalled applications and understands its concepts..",
        "category": "Profesionnal"
      },
      {
        "name": "Documentation",
        "rating": 3,
        "description": "Like anyone, I care to make the documentation evolve alongside my changes. Even if I tend to reduce documentation in code to a strict necessity because I'd rather make my code clearer.",
      },
      {
        "name": "Formations",
        "rating": 4,
        "description": "Divers"
      },
      {
        "name": "Scrum",
        "rating": 4,
        "description": "Depuis mon arrivee chez Canal+, je suis confronte a un environnement de travail Agile Scrum au quotidien, epaule par mes cours sur le sujet j'ai pu m'integrer dans cet environnement qui me plait fortement."
      },
      {
        "name": "Rust",
        "rating": 2,
        "description": "L'EPITA m'as introduit a la programmation bas niveau via le C et le C++ j'ai ete attire par le Rust car il arrive a melanger la performance de ces language, les abstractions des languages haut niveau, tout priorisant une approche de programmation fonctionnelle.",
        "category": "Geekly Learning"
      }
  ],
  "education": [
    {
      "name": "EPITA (Ecole pour l'Informatique et les Techniques Appliquees)",
      "duration": "September 2017 - Today",
      "description": "After a year of full time professional experience I wanted to take back on my studies to explore new paths in my ways of programming and learn new technics (Systems, Video Games, Software, etc ...)",
      "diploma": "Expert Computer Engineering Degree"
    },
    {
      "name": "Lycee Maximillien Sorre",
      "duration": "Septembre 2013 - Juillet 2015",
      "description": "This is were I learnt all my basics in web developpement and profesionnal ways of programming.",
      "diploma": "Technical Bachelor in Software Developpement for Corporations."
    }
  ]
}
