{
	"menuEntries": [
		{"anchor": "about", "title": "Introduction"},
		{"anchor": "experience", "title": "Experience Professionelle"},
		{"anchor": "education", "title": "Etudes"},
		{"anchor": "skills", "title": "Competences"},
		{"anchor": "teaching", "title": "Apprentissage"},
		{"anchor": "projects", "title": "Projets Personnels"}
	],
    "intro": {
      "title": "Developpeur <span class='text-primary'>Scala</span> && Typescript",
      "currentPosition": "Chez <img src='static/img/cplus.gif' height='16px'/> depuis <span class='text-primary'>2 ans</span>.",
      "body": [
        "Je travaille actuellement sur une API GraphQL ainsi que sur l'API REST principale qui est derriere tous nos clients frontaux dans une equipe de <span class='text-primary'>20</span>&nbsp;developpeurs.<br />",
        "Tous les jours, je travaille sur des systemes Reactifs et Evolutions avec l'aide de <span class='text-primary'>Play!</span> Framework, <span class='text-primary'>Akka</span>, <span class='text-primary'>Kafka</span>, <span class='text-primary'>Cassandra</span> et <span class='text-primary'>Redis</span>.<br />",
        "Convaincu par <span class='text-primary'>Agile</span> et les pratiques <span class='text-primary'>TDD</span>. J'ai l'habitude de travailler avec AWS, Docker et des infrastructures a etats immutables (Salt Stack et recemment Kubernetes)<br />",
        "Avant d'etre interne, j'etais un consultat sur differents BackOffices de Canal+.<br />",
        "J'ai ensuite ete engage en Apprentissage tout en preparent un Master en ingenierie informatique a <span class='text-primary'>EPITA</span>.<br />",
        "Je fais principalement du Scala mais venant du FrontEnd je travaille toujours sur des bibliotheques JavaScript pour les clients CanalPlus et de la Recherche et Developpement dans les nouvelles technologies front."
      ]
    },
	"experiences": [
      {
        "position": "Developpeur FullStack Scala/Typescript",
        "description": "Au sein de la Direction Technique et Distribution je travaille dans une equipe de 50 personnes. Challenge quotidiennement sur des problemes de performance et de qualite a forte charge, j'interviens sur differents projets en Scala, Java et Typescript dans un environnement Agile et eXtreme Programming, j'ai pour habitude d'etre polyvalent et peu occasionnelement faire du DevOps, du RUN (taches de production), des librairies javascript, des utilitaires CLI ou la mise en place d'integrations et de deploiments continus ainsi que du peer-programming, des formations intenes et de la redaction de documentation",
        "durationText": "Septembre 2017 - Aujourd'hui",
        "company": "Canal+",
        "companyImg": "<img src='img/cplus.gif' height='16px'/>",
        "ShowMore": {
          "projects": [
            {
              "title": "HAPI",
              "backdrop": "noBackdrop",
              "description": "HAPI est le backend de Canal+ responsable de la gestion du catalogue, des lectures, de la recommandation, la recherche ainsi que les droits des portails A la demande et Live du groupe Canal. Avec une forte charge et une grande diversite de clients (Boxes FAI, Mobiles, Web, Consoles, SmartTV).",
              "techs": [
                "Scala",
                "Play! Framework",
                "Cassandra",
                "Redis",
                "ElasticSearch",
                "MicroServices",
                "AWS",
                "NGINX"
              ]
            }
          ]
        }
      },
      {
        "position": "Developpeur FullStack PHP/Javascript et Typescript",
        "description": "Test",
        "company": "Omnilog",
        "durationText": "Septembre 2016 - Aout 2017",
        "showMore": {
          "projects": [
            {
              "title": "IHM Visio",
              "backdrop": "noBackdrop",
              "description": "Creation d'une interface qui permet de consulter en temps reel les statistiques de consommation Live et les raports d'audience du CSA pour tous les operateurs francais.",
              "techs": [
                "PHP",
                "Symfony2",
                "Javascript",
                "RaphaelJS",
                "HTML5",
                "Bootstrap"
              ]
            },
            {
              "title": "IHM BDDPe : Newsletter V3",
              "backdrop": "noBackdrop",
              "description": "Creation de l'interface Nesletter3 permet d'envoyer aux abonnes des newsletters hebdomadaires personnalisees selon leurs offres. Elle contiens un language de templating, un algorithme de preselection de diffusions, une interface pour la selection manuelle ainsi qu'un connexion a l'API des serveurs de mailling pour une diffusion simple",
              "techs": [
                "PHP",
                "Zend Framework",
                "OracleSQL",
                "JavaScript",
                "HTML4",
                "JSON",
                "REST"
              ]
            }
          ]
        }
      },
      {
        "position": "Developpeur FullStack C#/Javascript et Typescript",
        "description": "Developpeur C# (ASP .Net, Windows Forms), seul developpeur au sein d'une petite equipe de 5 personnes. NETCORP Etait une agence Web avec des clients importants (Bally, Stephane Bern, etc ...). Ceci fut ma premiere experience en gestion de Dette Technique et de realisation autonomes d'evolutions sur le CMS ainsi que le developpement de quelques outils internes",
        "company": "NETCORP Solutions",
        "durationText": "Juin 2015 - Mai 2016",
        "showMore": {
          "projects": [
            {
              "title": "IHM Devis",
              "backdrop": "noBackdrop",
              "description": "Creation d'une interface qui permet de consulter en temps reel les statistiques de consommation Live et les raports d'audience du CSA pour tous les operateurs francais.",
              "techs": [
                "C#",
                "WindowsForms",
                "SQLServer"
              ]
            },
            {
              "title": "MetroSystem",
              "backdrop": "noBackdrop",
              "description": "Creation de l'interface Nesletter3 permet d'envoyer aux abonnes des newsletters hebdomadaires personnalisees selon leurs offres. Elle contiens un language de templating, un algorithme de preselection de diffusions, une interface pour la selection manuelle ainsi qu'un connexion a l'API des serveurs de mailling pour une diffusion simple",
              "techs": [
                "C#",
                "ASP .Net",
                "SQL Server",
                "JavaScript (commonJS)",
                "HTML4"
              ]
            }
          ]
        }
      }
	],
  "education": [
    {
      "onClick": "Here HTML",
      "position": "Master d'Expertise en Ingeniere Informatique",
      "durationText": "Septembre 2017 - Aujourd'hui",
      "description": "Apres une premiere experience profesionnelle d'un an, j'ai decide de reprendre mes etudes afin d'en apprendre plus sur certains aspects de la programmation qui m;etait inconnus alors (Programmation systeme, jeux videos, algorithmie avancee",
      "company": "EPITA (Ecode Pour l'Informatique et les Techniques Avancees"
    }
  ],
  "skills": [
      {
        "name": "Scala",
        "rating": 4,
        "description": "Depuis 2ans j'ai appris mes bases en Scala avec Canal ce qui m'a introduit a la programmation fonctionnelle. En dehors du travail j'ai realise quelques projets personnels en Scala tel que FreightTrain et Swirl-GraphQL-Back. J'ai encore des lacunes sur certaines parties du language (Macros, Bonnes pratiques avances, sucres syntaxiques)",
        "category": "Profesionnal"
      },
      {
        "name": "GraphQL",
        "rating": 4,
        "description": "Depuis 2ans, sur une application frontend interne a l'equipe j'utilise GraphQL cote client. Recemment, depuis 1ans j'interviens sur notre service GraphQL ecrit en Scala avec l'aide de Sangria. J'ai egalement donne des formations pour une association de l'EPITA sur le developpement frontend concernant GraphQL",
        "category": "Profesionnal"
      },
      {
        "name": "TypeScript",
        "rating": 5,
        "description": "Depuis 4ans je travaille avec TypeScript profesionnellement et personnellement d'abord avec Angular2 puis avec ReactJS. C'est actuellement mon language de choix pour mes interfaces frontend bien que Rust avec yew m'interesse fortement",
        "category": "Profesionnal"
      },
      {
        "name": "JavaScript",
        "rating": 5,
        "description": "Depuis mes debuts en programmation Web, mes competentences en JavaScript natif m'ont permis de maintenir des projets anciens, de mieux comprendre les technologies et compilateurs JavaScript modernes et de constuire des applications legeres avec tres peu de dependances (comme ce portfolio)",
        "category": "Profesionnal"
      },
      {
        "name": "HTML5/CSS3",
        "rating": 5,
        "description": "L'HTML me suit depuis mes debuts en programmation. De l'HTML4/CSS2 j'ai connu la transition vers l'HTML5 et le CSS3 et les nombreuses ameliorations apportees par ces iterations.",
        "category": "Profesionnal"
      },
      {
        "name": "ElasticSearch",
        "rating": 4,
        "description": "ElasticSearch est le moteur d'indexation de choix des applicatifs Canal+. Outre la definition de templates et l'indexation de donnees, j'ai ete anmmene a maintenir des plugins ElasticSearch ecrits en Java.",
        "category": "Profesionnal"
      },
      {
        "name": "Cassandra",
        "rating": 4,
        "description": "Cassandra est le datastore au centre de nombreux applicatifs au sein de CanalPlus, noSql et extremmement performant, j'ai acquis une bonne experience dans son utilisation dans des applications Scala. Je connais sur le principe ses systemes de replication mais je n'ai jamais administre de cluster cassandra.",
        "category": "Profesionnal"
      },
      {
        "name": "Documentation",
        "rating": 3,
        "description": "J'ai du a de nombreuses reprises entretenir et enrichir les documentations de certains projets simples ou complexes."
      },
      {
        "name": "Formations",
        "rating": 4,
        "description": "Test"
      },
      {
        "name": "Scrum",
        "rating": 4,
        "description": "Depuis mon arrivee chez Canal+, je suis confronte a un environnement de travail Agile Scrum au quotidien, epaule par mes cours sur le sujet j'ai pu m'integrer dans cet environnement qui me plait fortement."
      },
      {
        "name": "Rust",
        "rating": 2,
        "description": "L'EPITA m'as introduit a la programmation bas niveau via le C et le C++ j'ai ete attire par le Rust car il arrive a melanger la performance de ces language, les abstractions des languages haut niveau, tout priorisant une approche de programmation fonctionnelle.",
        "category": "Geekly Learning"
      }
  ],
  "generalText": {
    "seeMore": "En savoir plus"
  }
}
